sanapos/sboxhrm/firmware/esp32c3-zk-gateway/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# ESP32-C3 module enumerates as VID 303A / PID 1001 -> console over native USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Trust store: full CA bundle so any Let's Encrypt / commercial cert on the ADMS server works
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# TLS record buffers are the biggest RAM consumer on a C3; shrink them and free between sessions
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=8192
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y

CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192
CONFIG_LWIP_TCP_WND_DEFAULT=8192

CONFIG_ESP_TASK_WDT_TIMEOUT_S=60

CONFIG_BT_ENABLED=n
